--- src/signature/mod.rs
+++ delete ! in validate_fes_fea
@@ -268,17 +268,17 @@
 /// Validate FES/FEA constraints: algorithm↔level, biometric requirement,
 /// commitment format, and public key size. Returns `Ok(())` or a `SignatureError`.
 pub fn validate_fes_fea(
     level: SignatureLevel,
     algorithm: SigningAlgorithm,
     evidence: &[BiometricEvidence],
     public_key_hex: &str,
 ) -> Result<(), SignatureError> {
-    if !level.algorithm_satisfies(algorithm) {
+    if  /* ~ changed by cargo-mutants ~ */level.algorithm_satisfies(algorithm) {
         return Err(SignatureError::AlgorithmMismatch {
             level,
             expected: level.required_algorithm(),
             got: algorithm,
         });
     }
     if level.requires_biometric() && evidence.is_empty() {
         return Err(SignatureError::BiometricRequired(level));
