--- src/signature/mod.rs
+++ replace <impl std::fmt::Display for SignatureLevel>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -79,21 +79,17 @@
             Self::Simple => true, // any algorithm accepted
             Self::Advanced | Self::Qualified => alg.is_post_quantum(),
         }
     }
 }
 
 impl std::fmt::Display for SignatureLevel {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::Simple => write!(f, "Simple (FES)"),
-            Self::Advanced => write!(f, "Advanced (FEA)"),
-            Self::Qualified => write!(f, "Qualified"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ── Biometric evidence ───────────────────────────────────────────────────────
 
 /// Type of biometric or identity evidence.
 ///
 /// Extensible: new variants can be added without breaking serialization
