--- src/signature/verify.rs
+++ replace verify_ed25519 -> bool with false
@@ -3,36 +3,17 @@
 //! All handlers that verify cryptographic signatures should use these
 //! functions instead of implementing their own. This ensures consistent
 //! behavior and makes algorithm upgrades a single-point change.
 
 use crate::identity::signing::SigningAlgorithm;
 
 /// Verify an Ed25519 signature over a message.
 pub fn verify_ed25519(public_key_hex: &str, message: &[u8], signature_hex: &str) -> bool {
-    let pub_bytes = match hex::decode(public_key_hex) {
-        Ok(b) if b.len() == 32 => b,
-        _ => return false,
-    };
-    let sig_bytes = match hex::decode(signature_hex) {
-        Ok(b) if b.len() == 64 => b,
-        _ => return false,
-    };
-    use pqc_crypto_module::legacy::ed25519::{Signature, Verifier, VerifyingKey};
-    match (
-        pub_bytes
-            .as_slice()
-            .try_into()
-            .ok()
-            .and_then(|b: &[u8; 32]| VerifyingKey::from_bytes(b).ok()),
-        Signature::from_slice(&sig_bytes).ok(),
-    ) {
-        (Some(vk), Some(sig)) => vk.verify(message, &sig).is_ok(),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Verify an ML-DSA-65 (FIPS 204) signature over a message.
 pub fn verify_mldsa65(public_key_hex: &str, message: &[u8], signature_hex: &str) -> bool {
     let pub_bytes = match hex::decode(public_key_hex) {
         Ok(b) if b.len() == 1952 => b,
         _ => return false,
     };
