--- src/signature/verify.rs
+++ delete match arm (Some(vk), Some(sig)) in verify_ed25519
@@ -20,17 +20,17 @@
     match (
         pub_bytes
             .as_slice()
             .try_into()
             .ok()
             .and_then(|b: &[u8; 32]| VerifyingKey::from_bytes(b).ok()),
         Signature::from_slice(&sig_bytes).ok(),
     ) {
-        (Some(vk), Some(sig)) => vk.verify(message, &sig).is_ok(),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 /// Verify an ML-DSA-65 (FIPS 204) signature over a message.
 pub fn verify_mldsa65(public_key_hex: &str, message: &[u8], signature_hex: &str) -> bool {
     let pub_bytes = match hex::decode(public_key_hex) {
         Ok(b) if b.len() == 1952 => b,
