--- src/signature/verify.rs
+++ replace * with / in validate_public_key
@@ -77,17 +77,17 @@
 pub fn validate_public_key(
     algorithm: SigningAlgorithm,
     public_key_hex: &str,
 ) -> Result<(), String> {
     let expected_bytes = match algorithm {
         SigningAlgorithm::Ed25519 => 32,
         SigningAlgorithm::MlDsa65 => 1952,
     };
-    let expected_hex = expected_bytes * 2;
+    let expected_hex = expected_bytes / /* ~ changed by cargo-mutants ~ */ 2;
     if public_key_hex.len() != expected_hex {
         return Err(format!(
             "public_key must be {expected_hex} hex characters ({expected_bytes} bytes {algorithm})"
         ));
     }
     if hex::decode(public_key_hex).is_err() {
         return Err("public_key is not valid hex".into());
     }
